app/views/friends/index.html.erb

              <td>
                <%= link_to User.find_by(id:friend.friend_id).login, friend %>
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 2 LIMIT 1