app/views/users/index.html.erb

              <td>
                <% if logged_in? && Friend.find_by(user_id: current_user.id, friend_id: user.id) == nil %>
---
SELECT  `friends`.* FROM `friends` WHERE `friends`.`user_id` = 2 AND `friends`.`friend_id` = 1 LIMIT 1