app/views/users/show.html.erb

  <div class="col-md-8">
    <% if @user.microposts.any? %>
---
SELECT  1 AS one FROM `microposts` WHERE `microposts`.`user_id` = 1 LIMIT 1