app/views/shared/_user_info.html.erb

SELECT COUNT(*) FROM `microposts` WHERE `microposts`.`user_id` = 2
---
<span><%= link_to "view my profile", current_user %></span>
<span><%= pluralize(current_user.microposts.count, "micropost") %></span>