app/views/microposts/_micropost.html.erb

SELECT  `groups`.* FROM `groups` WHERE `groups`.`id` = 3 LIMIT 1
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 2 LIMIT 1
---
    </span>
  <span class="timestamp">Posted <%= time_ago_in_words(micropost.created_at) %> ago.
    <% if current_user?(micropost.user) || current_user.admin? || micropost.group.owner_id == current_user.id%>