app/controllers/friends_controller.rb

SELECT  `friends`.* FROM `friends`  ORDER BY `friends`.`id` ASC LIMIT 1000
---
  def index
    @friends = nil
    Friend.find_each do |friend|

INSERT INTO `friends` (`user_id`, `friend_id`) VALUES (2, 1)
---
  def add
    @friend = Friend.new(user_id: current_user.id, friend_id: params[:id])
    if @friend.save

SELECT  `friends`.* FROM `friends` WHERE `friends`.`friend_id` = 1 LIMIT 1
DELETE FROM `friends` WHERE `friends`.`id` = 1
---
  def remove

    @friend = Friend.find_by(friend_id: params[:id])
    Friend.delete(@friend)