app/controllers/groups_controller.rb

  def show
    @group = Group.find(params[:id])
    @micropost = @group.microposts.build
    @feed_items = @group.feed.paginate(page: params[:page])
---
SELECT  `groups`.* FROM `groups` WHERE `groups`.`id` = 1 LIMIT 1
SELECT  `microposts`.* FROM `microposts` WHERE (group_id = 3)  ORDER BY `microposts`.`created_at` DESC LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM `microposts` WHERE (group_id = 3)

  def changestatus
    @group = Group.find(params[:id])
    if @group.status == true
      @group.status = false
    else
      @group.status = true
    end
    @group.save
---
SELECT  `groups`.* FROM `groups` WHERE `groups`.`id` = 1 LIMIT 1
UPDATE `groups` SET `status` = 0 WHERE `groups`.`id` = 1

  def destroy
    @group = Group.find(params[:id])
    Micropost.destroy_all(group_id:@group.id)
---
SELECT  `groups`.* FROM `groups` WHERE `groups`.`id` = 32375484 LIMIT 1
DELETE FROM `groups` WHERE `groups`.`id` = 1
DELETE FROM `microposts` WHERE `microposts`.`id` = 2

  def index
    @groups = Group.all
---
SELECT `groups`.* FROM `groups`

  def create
    params.permit!
    puts params
    @group = Group.new(status:params[:group][:status], name:params[:group][:name],owner_id:current_user.id)
    if @group.save
---
INSERT INTO `groups` (`status`, `name`, `owner_id`) VALUES (0, 'алкашино', 2)