app/controllers/microposts_controller.rb

  def create
    @micropost = Micropost.new(group_id:params[:micropost][:group_id], content:params[:micropost][:content], user_id:current_user.id)
    if @micropost.save
---
INSERT INTO `microposts` (`group_id`, `content`, `user_id`, `created_at`, `updated_at`) VALUES (1, 'вы все лалки', 2, '2016-11-27 00:01:34', '2016-11-27 00:01:34')

  def destroy
    @micropost.destroy
---
DELETE FROM `microposts` WHERE `microposts`.`id` = 4

  def edit
    params.permit!
    @micropost = Micropost.find(params[:id].to_i)
---
SELECT  `microposts`.* FROM `microposts` WHERE `microposts`.`id` = 11  ORDER BY `microposts`.`created_at` DESC LIMIT 1

  def post
    params.permit!
    @micropost = Micropost.find(params[:sender].to_i)
    @micropost.content = params[:content]
    @micropost.save
---
SELECT  `microposts`.* FROM `microposts` WHERE `microposts`.`id` = 0  ORDER BY `microposts`.`created_at` DESC LIMIT 1
UPDATE `microposts` SET `content` = 'new', `updated_at` = '2016-12-16 16:06:29' WHERE `microposts`.`id` = 11