app/controllers/sessions_controller.rb

SELECT  `users`.* FROM `users` WHERE `users`.`login` = 'петр' LIMIT 1
---
  def create
    user = User.find_by(login: params[:session][:login].downcase)