app/controllers/text_chat_controller.rb

  def list
    @messages = Message.all
    @msg = []
    @messages.each do |m|
      if m.receiver_id == current_user.id
        @msg.append([User.find(m.sender_id), m.text, m.created_at])
---
SELECT `messages`.* FROM `messages`
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1

  def dialog
    @msgs = Message.all
    params.permit!
    @second = params[:id].to_i
    @name = User.find(@second)
---
SELECT `messages`.* FROM `messages`
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 2 LIMIT 1

  def send_msg
    params = msg_params
    @msg = Message.new({sender_id: params[:sender], receiver_id: params[:receiver], text: params[:text]})
    @msg.save
---
INSERT INTO `messages` (`sender_id`, `receiver_id`, `text`, `created_at`, `updated_at`) VALUES (2, 1, 'привет петя)))))))))', '2016-12-03 15:41:36', '2016-12-03 15:41:36')