app/controllers/users_controller.rb

  def show
    @user = User.find(params[:id])
    @microposts = @user.microposts.paginate(page: params[:page])
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
SELECT  `microposts`.* FROM `microposts` WHERE `microposts`.`user_id` = 3  ORDER BY `microposts`.`created_at` DESC LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM `microposts` WHERE `microposts`.`user_id` = 3

  def create
    params.permit!
    @user = User.new(params[:user])
    if @user.save
---
INSERT INTO `users` (`login`, `password_digest`) VALUES ('петр', '$2a$10$ks3i8LXBwMDTl84QaPlhXetuXRwywg6p4mxhxvNqZP/GbhSXR5Yl2')

  def destroy
    @user = User.find(params[:id])

    Micropost.destroy_all(user_id:@user.id)
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 4 LIMIT 1
DELETE FROM `users` WHERE `users`.`id` = 4

  def list_json
    render json: User.all
---
SELECT `users`.* FROM `users`

  def update
    @user = User.find(params[:id])
    if @user.update_attributes(user_params)
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 2 LIMIT 1
UPDATE `users` SET `login` = 'vladimir', `password_digest` = '$2a$10$5h/a6gr1z6w1z8uwC14kZOLgJn5wMAYP4k8Ne7UReQvQ8evi8jNW.' WHERE `users`.`id` = 2